11/data/attachments/74cd41ba1ea2e23f.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_4a12cc2e-af0c-4da1-be21-c2e5a632d439</nif:username>
            <nif:friendToBeAdded>Troy_fact_Friend_30642_7</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>